Ran Plan for dir: `terraform/sqs` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/88/default/terraform/sqs/crawlinghub-sqs-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/88/default/terraform/sqs": exit status 1
aws_kms_key.sqs: Refreshing state... [id=c92362b0-6353-416d-af2b-e09c875bae36]
aws_kms_alias.sqs: Refreshing state... [id=alias/crawlinghub-sqs-prod]
module.crawling_task_queue.aws_sqs_queue.dlq[0]: Refreshing state... [id=https://sqs.ap-northeast-2.amazonaws.com/646886795421/prod-monitoring-sqs-crawlinghub-crawling-task-dlq]
module.eventbridge_trigger_queue.aws_sqs_queue.dlq[0]: Refreshing state... [id=https://sqs.ap-northeast-2.amazonaws.com/646886795421/prod-monitoring-sqs-crawlinghub-eventbridge-trigger-dlq]
module.eventbridge_trigger_queue.aws_cloudwatch_metric_alarm.dlq-messages[0]: Refreshing state... [id=prod-monitoring-sqs-crawlinghub-eventbridge-trigger-dlq-messages-visible]
module.eventbridge_trigger_queue.aws_sqs_queue.this: Refreshing state... [id=https://sqs.ap-northeast-2.amazonaws.com/646886795421/prod-monitoring-sqs-crawlinghub-eventbridge-trigger]
module.crawling_task_queue.aws_cloudwatch_metric_alarm.dlq-messages[0]: Refreshing state... [id=prod-monitoring-sqs-crawlinghub-crawling-task-dlq-messages-visible]
module.crawling_task_queue.aws_sqs_queue.this: Refreshing state... [id=https://sqs.ap-northeast-2.amazonaws.com/646886795421/prod-monitoring-sqs-crawlinghub-crawling-task]
aws_ssm_parameter.dlq_url: Refreshing state... [id=/crawlinghub/sqs/crawling-task-dlq-url]
module.eventbridge_trigger_queue.aws_cloudwatch_metric_alarm.message-age[0]: Refreshing state... [id=prod-monitoring-sqs-crawlinghub-eventbridge-trigger-message-age-high]
module.eventbridge_trigger_queue.aws_cloudwatch_metric_alarm.messages-visible[0]: Refreshing state... [id=prod-monitoring-sqs-crawlinghub-eventbridge-trigger-messages-visible-high]
module.crawling_task_queue.aws_cloudwatch_metric_alarm.message-age[0]: Refreshing state... [id=prod-monitoring-sqs-crawlinghub-crawling-task-message-age-high]
aws_ssm_parameter.eventbridge_trigger_queue_url: Refreshing state... [id=/crawlinghub/sqs/eventbridge-trigger-queue-url]
module.crawling_task_queue.aws_cloudwatch_metric_alarm.messages-visible[0]: Refreshing state... [id=prod-monitoring-sqs-crawlinghub-crawling-task-messages-visible-high]
aws_ssm_parameter.eventbridge_trigger_queue_arn: Refreshing state... [id=/crawlinghub/sqs/eventbridge-trigger-queue-arn]
aws_ssm_parameter.queue_url: Refreshing state... [id=/crawlinghub/sqs/crawling-task-queue-url]
aws_ssm_parameter.queue_arn: Refreshing state... [id=/crawlinghub/sqs/crawling-task-queue-arn]
aws_iam_policy.sqs_access: Refreshing state... [id=arn:aws:iam::646886795421:policy/crawlinghub-sqs-access-prod]
aws_ssm_parameter.sqs_policy_arn: Refreshing state... [id=/crawlinghub/sqs/access-policy-arn]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.aws_iam_policy_document.sqs_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sqs_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:ChangeMessageVisibility",
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:GetQueueUrl",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:ap-northeast-2:646886795421:prod-monitoring-sqs-crawlinghub-crawling-task",
              + "arn:aws:sqs:ap-northeast-2:646886795421:prod-monitoring-sqs-crawlinghub-crawling-task-dlq",
              + "arn:aws:sqs:ap-northeast-2:646886795421:prod-monitoring-sqs-crawlinghub-eventbridge-trigger",
              + "arn:aws:sqs:ap-northeast-2:646886795421:prod-monitoring-sqs-crawlinghub-eventbridge-trigger-dlq",
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "AllowSQSAccess"
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:GenerateDataKey",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:kms:ap-northeast-2:646886795421:key/c92362b0-6353-416d-af2b-e09c875bae36",
            ]
          + sid       = "AllowKMSForSQS"
        }
    }

  # aws_iam_policy.sqs_access will be updated in-place
  ~ resource "aws_iam_policy" "sqs_access" {
        id               = "arn:aws:iam::646886795421:policy/crawlinghub-sqs-access-prod"
        name             = "crawlinghub-sqs-access-prod"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "sqs:SendMessage",
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueUrl",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                          - "sqs:ChangeMessageVisibility",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sqs:ap-northeast-2:646886795421:prod-monitoring-sqs-crawlinghub-eventbridge-trigger-dlq",
                          - "arn:aws:sqs:ap-northeast-2:646886795421:prod-monitoring-sqs-crawlinghub-eventbridge-trigger",
                          - "arn:aws:sqs:ap-northeast-2:646886795421:prod-monitoring-sqs-crawlinghub-crawling-task-dlq",
                          - "arn:aws:sqs:ap-northeast-2:646886795421:prod-monitoring-sqs-crawlinghub-crawling-task",
                        ]
                      - Sid      = "AllowSQSAccess"
                    },
                  - {
                      - Action   = [
                          - "kms:GenerateDataKey",
                          - "kms:Decrypt",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:ap-northeast-2:646886795421:key/c92362b0-6353-416d-af2b-e09c875bae36"
                      - Sid      = "AllowKMSForSQS"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Environment" = "prod"
            "Name"        = "crawlinghub-sqs-access-prod"
            "Service"     = "crawlinghub-sqs"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_ssm_parameter.product_image_dlq_url will be created
  + resource "aws_ssm_parameter" "product_image_dlq_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "CrawlingHub product image DLQ URL"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/crawlinghub/sqs/product-image-dlq-url"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "crawlinghub-sqs-product-image-dlq-url"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-sqs-product-image-dlq-url"
          + "Project"     = "crawlinghub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.product_image_queue_arn will be created
  + resource "aws_ssm_parameter" "product_image_queue_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "CrawlingHub product image queue ARN"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/crawlinghub/sqs/product-image-queue-arn"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "crawlinghub-sqs-product-image-queue-arn"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-sqs-product-image-queue-arn"
          + "Project"     = "crawlinghub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.product_image_queue_url will be created
  + resource "aws_ssm_parameter" "product_image_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "CrawlingHub product image queue URL"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/crawlinghub/sqs/product-image-queue-url"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "crawlinghub-sqs-product-image-queue-url"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-sqs-product-image-queue-url"
          + "Project"     = "crawlinghub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.product_sync_dlq_url will be created
  + resource "aws_ssm_parameter" "product_sync_dlq_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "CrawlingHub product sync DLQ URL"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/crawlinghub/sqs/product-sync-dlq-url"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "crawlinghub-sqs-product-sync-dlq-url"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-sqs-product-sync-dlq-url"
          + "Project"     = "crawlinghub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.product_sync_queue_arn will be created
  + resource "aws_ssm_parameter" "product_sync_queue_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "CrawlingHub product sync queue ARN"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/crawlinghub/sqs/product-sync-queue-arn"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "crawlinghub-sqs-product-sync-queue-arn"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-sqs-product-sync-queue-arn"
          + "Project"     = "crawlinghub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.product_sync_queue_url will be created
  + resource "aws_ssm_parameter" "product_sync_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "CrawlingHub product sync queue URL"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/crawlinghub/sqs/product-sync-queue-url"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "crawlinghub-sqs-product-sync-queue-url"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-sqs-product-sync-queue-url"
          + "Project"     = "crawlinghub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.product_image_queue.aws_cloudwatch_metric_alarm.dlq-messages[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "dlq-messages" {
      + actions_enabled                       = true
      + alarm_description                     = "Alerts when DLQ receives messages (processing failures)"
      + alarm_name                            = "prod-monitoring-sqs-crawlinghub-product-image-dlq-messages-visible"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "prod-monitoring-sqs-crawlinghub-product-image-dlq"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "AlarmType"   = "DLQMessages"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-monitoring-sqs-crawlinghub-product-image-dlq-messages-visible"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-sqs"
        }
      + tags_all                              = {
          + "AlarmType"   = "DLQMessages"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-monitoring-sqs-crawlinghub-product-image-dlq-messages-visible"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-sqs"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # module.product_image_queue.aws_cloudwatch_metric_alarm.message-age[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "message-age" {
      + actions_enabled                       = true
      + alarm_description                     = "Alerts when messages are not being processed (old messages accumulating)"
      + alarm_name                            = "prod-monitoring-sqs-crawlinghub-product-image-message-age-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "prod-monitoring-sqs-crawlinghub-product-image"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + period                                = 300
      + statistic                             = "Maximum"
      + tags                                  = {
          + "AlarmType"   = "MessageAge"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-monitoring-sqs-crawlinghub-product-image-message-age-high"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-sqs"
        }
      + tags_all                              = {
          + "AlarmType"   = "MessageAge"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-monitoring-sqs-crawlinghub-product-image-message-age-high"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-sqs"
        }
      + threshold                             = 600
      + treat_missing_data                    = "notBreaching"
    }

  # module.product_image_queue.aws_cloudwatch_metric_alarm.messages-visible[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "messages-visible" {
      + actions_enabled                       = true
      + alarm_description                     = "Alerts when queue depth is too high (backlog building up)"
      + alarm_name                            = "prod-monitoring-sqs-crawlinghub-product-image-messages-visible-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "prod-monitoring-sqs-crawlinghub-product-image"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "AlarmType"   = "MessagesVisible"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-monitoring-sqs-crawlinghub-product-image-messages-visible-high"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-sqs"
        }
      + tags_all                              = {
          + "AlarmType"   = "MessagesVisible"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-monitoring-sqs-crawlinghub-product-image-messages-visible-high"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-sqs"
        }
      + threshold                             = 500
      + treat_missing_data                    = "notBreaching"
    }

  # module.product_image_queue.aws_sqs_queue.dlq[0] will be created
  + resource "aws_sqs_queue" "dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 300
      + kms_master_key_id                 = "arn:aws:kms:ap-northeast-2:646886795421:key/c92362b0-6353-416d-af2b-e09c875bae36"
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "prod-monitoring-sqs-crawlinghub-product-image-dlq"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "CostCenter"   = "engineering"
          + "DataClass"    = "confidential"
          + "Environment"  = "prod"
          + "KMSEncrypted" = "true"
          + "Lifecycle"    = "production"
          + "ManagedBy"    = "terraform"
          + "Name"         = "prod-monitoring-sqs-crawlinghub-product-image-dlq"
          + "Owner"        = "platform@ryuqqq.com"
          + "Project"      = "crawlinghub"
          + "QueueRole"    = "DLQ"
          + "QueueType"    = "Standard"
          + "Service"      = "crawlinghub-sqs"
        }
      + tags_all                          = {
          + "CostCenter"   = "engineering"
          + "DataClass"    = "confidential"
          + "Environment"  = "prod"
          + "KMSEncrypted" = "true"
          + "Lifecycle"    = "production"
          + "ManagedBy"    = "terraform"
          + "Name"         = "prod-monitoring-sqs-crawlinghub-product-image-dlq"
          + "Owner"        = "platform@ryuqqq.com"
          + "Project"      = "crawlinghub"
          + "QueueRole"    = "DLQ"
          + "QueueType"    = "Standard"
          + "Service"      = "crawlinghub-sqs"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.product_image_queue.aws_sqs_queue.this will be created
  + resource "aws_sqs_queue" "this" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 300
      + kms_master_key_id                 = "arn:aws:kms:ap-northeast-2:646886795421:key/c92362b0-6353-416d-af2b-e09c875bae36"
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "prod-monitoring-sqs-crawlinghub-product-image"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 20
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "CostCenter"   = "engineering"
          + "DLQEnabled"   = "true"
          + "DataClass"    = "confidential"
          + "Environment"  = "prod"
          + "KMSEncrypted" = "true"
          + "Lifecycle"    = "production"
          + "ManagedBy"    = "terraform"
          + "Name"         = "prod-monitoring-sqs-crawlinghub-product-image"
          + "Owner"        = "platform@ryuqqq.com"
          + "Project"      = "crawlinghub"
          + "QueueRole"    = "Main"
          + "QueueType"    = "Standard"
          + "Service"      = "crawlinghub-sqs"
        }
      + tags_all                          = {
          + "CostCenter"   = "engineering"
          + "DLQEnabled"   = "true"
          + "DataClass"    = "confidential"
          + "Environment"  = "prod"
          + "KMSEncrypted" = "true"
          + "Lifecycle"    = "production"
          + "ManagedBy"    = "terraform"
          + "Name"         = "prod-monitoring-sqs-crawlinghub-product-image"
          + "Owner"        = "platform@ryuqqq.com"
          + "Project"      = "crawlinghub"
          + "QueueRole"    = "Main"
          + "QueueType"    = "Standard"
          + "Service"      = "crawlinghub-sqs"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 120
    }

  # module.product_sync_queue.aws_cloudwatch_metric_alarm.dlq-messages[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "dlq-messages" {
      + actions_enabled                       = true
      + alarm_description                     = "Alerts when DLQ receives messages (processing failures)"
      + alarm_name                            = "prod-monitoring-sqs-crawlinghub-product-sync-dlq-messages-visible"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "prod-monitoring-sqs-crawlinghub-product-sync-dlq"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "AlarmType"   = "DLQMessages"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-monitoring-sqs-crawlinghub-product-sync-dlq-messages-visible"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-sqs"
        }
      + tags_all                              = {
          + "AlarmType"   = "DLQMessages"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-monitoring-sqs-crawlinghub-product-sync-dlq-messages-visible"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-sqs"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # module.product_sync_queue.aws_cloudwatch_metric_alarm.message-age[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "message-age" {
      + actions_enabled                       = true
      + alarm_description                     = "Alerts when messages are not being processed (old messages accumulating)"
      + alarm_name                            = "prod-monitoring-sqs-crawlinghub-product-sync-message-age-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "prod-monitoring-sqs-crawlinghub-product-sync"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + period                                = 300
      + statistic                             = "Maximum"
      + tags                                  = {
          + "AlarmType"   = "MessageAge"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-monitoring-sqs-crawlinghub-product-sync-message-age-high"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-sqs"
        }
      + tags_all                              = {
          + "AlarmType"   = "MessageAge"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-monitoring-sqs-crawlinghub-product-sync-message-age-high"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-sqs"
        }
      + threshold                             = 600
      + treat_missing_data                    = "notBreaching"
    }

  # module.product_sync_queue.aws_cloudwatch_metric_alarm.messages-visible[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "messages-visible" {
      + actions_enabled                       = true
      + alarm_description                     = "Alerts when queue depth is too high (backlog building up)"
      + alarm_name                            = "prod-monitoring-sqs-crawlinghub-product-sync-messages-visible-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "prod-monitoring-sqs-crawlinghub-product-sync"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "AlarmType"   = "MessagesVisible"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-monitoring-sqs-crawlinghub-product-sync-messages-visible-high"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-sqs"
        }
      + tags_all                              = {
          + "AlarmType"   = "MessagesVisible"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-monitoring-sqs-crawlinghub-product-sync-messages-visible-high"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-sqs"
        }
      + threshold                             = 500
      + treat_missing_data                    = "notBreaching"
    }

  # module.product_sync_queue.aws_sqs_queue.dlq[0] will be created
  + resource "aws_sqs_queue" "dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 300
      + kms_master_key_id                 = "arn:aws:kms:ap-northeast-2:646886795421:key/c92362b0-6353-416d-af2b-e09c875bae36"
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "prod-monitoring-sqs-crawlinghub-product-sync-dlq"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "CostCenter"   = "engineering"
          + "DataClass"    = "confidential"
          + "Environment"  = "prod"
          + "KMSEncrypted" = "true"
          + "Lifecycle"    = "production"
          + "ManagedBy"    = "terraform"
          + "Name"         = "prod-monitoring-sqs-crawlinghub-product-sync-dlq"
          + "Owner"        = "platform@ryuqqq.com"
          + "Project"      = "crawlinghub"
          + "QueueRole"    = "DLQ"
          + "QueueType"    = "Standard"
          + "Service"      = "crawlinghub-sqs"
        }
      + tags_all                          = {
          + "CostCenter"   = "engineering"
          + "DataClass"    = "confidential"
          + "Environment"  = "prod"
          + "KMSEncrypted" = "true"
          + "Lifecycle"    = "production"
          + "ManagedBy"    = "terraform"
          + "Name"         = "prod-monitoring-sqs-crawlinghub-product-sync-dlq"
          + "Owner"        = "platform@ryuqqq.com"
          + "Project"      = "crawlinghub"
          + "QueueRole"    = "DLQ"
          + "QueueType"    = "Standard"
          + "Service"      = "crawlinghub-sqs"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.product_sync_queue.aws_sqs_queue.this will be created
  + resource "aws_sqs_queue" "this" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 300
      + kms_master_key_id                 = "arn:aws:kms:ap-northeast-2:646886795421:key/c92362b0-6353-416d-af2b-e09c875bae36"
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "prod-monitoring-sqs-crawlinghub-product-sync"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 20
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "CostCenter"   = "engineering"
          + "DLQEnabled"   = "true"
          + "DataClass"    = "confidential"
          + "Environment"  = "prod"
          + "KMSEncrypted" = "true"
          + "Lifecycle"    = "production"
          + "ManagedBy"    = "terraform"
          + "Name"         = "prod-monitoring-sqs-crawlinghub-product-sync"
          + "Owner"        = "platform@ryuqqq.com"
          + "Project"      = "crawlinghub"
          + "QueueRole"    = "Main"
          + "QueueType"    = "Standard"
          + "Service"      = "crawlinghub-sqs"
        }
      + tags_all                          = {
          + "CostCenter"   = "engineering"
          + "DLQEnabled"   = "true"
          + "DataClass"    = "confidential"
          + "Environment"  = "prod"
          + "KMSEncrypted" = "true"
          + "Lifecycle"    = "production"
          + "ManagedBy"    = "terraform"
          + "Name"         = "prod-monitoring-sqs-crawlinghub-product-sync"
          + "Owner"        = "platform@ryuqqq.com"
          + "Project"      = "crawlinghub"
          + "QueueRole"    = "Main"
          + "QueueType"    = "Standard"
          + "Service"      = "crawlinghub-sqs"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 180
    }

Plan: 16 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + product_image_dlq_arn          = (known after apply)
  + product_image_dlq_url          = (known after apply)
  + product_image_queue_arn        = (known after apply)
  + product_image_queue_name       = "prod-monitoring-sqs-crawlinghub-product-image"
  + product_image_queue_url        = (known after apply)
  + product_sync_dlq_arn           = (known after apply)
  + product_sync_dlq_url           = (known after apply)
  + product_sync_queue_arn         = (known after apply)
  + product_sync_queue_name        = "prod-monitoring-sqs-crawlinghub-product-sync"
  + product_sync_queue_url         = (known after apply)
╷
│ Error: listing tags for CloudWatch Metric Alarm (arn:aws:cloudwatch:ap-northeast-2:646886795421:alarm:prod-monitoring-sqs-crawlinghub-crawling-task-message-age-high): operation error CloudWatch: ListTagsForResource, https response error StatusCode: 403, RequestID: d2683550-8334-402d-b133-41348283b389, api error AccessDenied: User: arn:aws:sts::646886795421:assumed-role/atlantis-ecs-task-prod/731f9812c68d49d69f47d7c93207fa8d is not authorized to perform: cloudwatch:ListTagsForResource on resource: arn:aws:cloudwatch:ap-northeast-2:646886795421:alarm:prod-monitoring-sqs-crawlinghub-crawling-task-message-age-high because no identity-based policy allows the cloudwatch:ListTagsForResource action
│ 
│   with module.crawling_task_queue.aws_cloudwatch_metric_alarm.message-age[0],
│   on .terraform/modules/crawling_task_queue/terraform/modules/sqs/main.tf line 107, in resource "aws_cloudwatch_metric_alarm" "message-age":
│  107: resource "aws_cloudwatch_metric_alarm" "message-age" {
│ 
╵
╷
│ Error: listing tags for CloudWatch Metric Alarm (arn:aws:cloudwatch:ap-northeast-2:646886795421:alarm:prod-monitoring-sqs-crawlinghub-crawling-task-messages-visible-high): operation error CloudWatch: ListTagsForResource, https response error StatusCode: 403, RequestID: d17dff84-4d49-48ae-a175-3626ccc0fe2e, api error AccessDenied: User: arn:aws:sts::646886795421:assumed-role/atlantis-ecs-task-prod/731f9812c68d49d69f47d7c93207fa8d is not authorized to perform: cloudwatch:ListTagsForResource on resource: arn:aws:cloudwatch:ap-northeast-2:646886795421:alarm:prod-monitoring-sqs-crawlinghub-crawling-task-messages-visible-high because no identity-based policy allows the cloudwatch:ListTagsForResource action
│ 
│   with module.crawling_task_queue.aws_cloudwatch_metric_alarm.messages-visible[0],
│   on .terraform/modules/crawling_task_queue/terraform/modules/sqs/main.tf line 138, in resource "aws_cloudwatch_metric_alarm" "messages-visible":
│  138: resource "aws_cloudwatch_metric_alarm" "messages-visible" {
│ 
╵
╷
│ Error: listing tags for CloudWatch Metric Alarm (arn:aws:cloudwatch:ap-northeast-2:646886795421:alarm:prod-monitoring-sqs-crawlinghub-crawling-task-dlq-messages-visible): operation error CloudWatch: ListTagsForResource, https response error StatusCode: 403, RequestID: 62b0fe97-fa80-4190-98b0-3395631c32da, api error AccessDenied: User: arn:aws:sts::646886795421:assumed-role/atlantis-ecs-task-prod/731f9812c68d49d69f47d7c93207fa8d is not authorized to perform: cloudwatch:ListTagsForResource on resource: arn:aws:cloudwatch:ap-northeast-2:646886795421:alarm:prod-monitoring-sqs-crawlinghub-crawling-task-dlq-messages-visible because no identity-based policy allows the cloudwatch:ListTagsForResource action
│ 
│   with module.crawling_task_queue.aws_cloudwatch_metric_alarm.dlq-messages[0],
│   on .terraform/modules/crawling_task_queue/terraform/modules/sqs/main.tf line 169, in resource "aws_cloudwatch_metric_alarm" "dlq-messages":
│  169: resource "aws_cloudwatch_metric_alarm" "dlq-messages" {
│ 
╵
╷
│ Error: listing tags for CloudWatch Metric Alarm (arn:aws:cloudwatch:ap-northeast-2:646886795421:alarm:prod-monitoring-sqs-crawlinghub-eventbridge-trigger-message-age-high): operation error CloudWatch: ListTagsForResource, https response error StatusCode: 403, RequestID: 51ad5a6c-8537-4bda-ae4f-e8e7b09d2403, api error AccessDenied: User: arn:aws:sts::646886795421:assumed-role/atlantis-ecs-task-prod/731f9812c68d49d69f47d7c93207fa8d is not authorized to perform: cloudwatch:ListTagsForResource on resource: arn:aws:cloudwatch:ap-northeast-2:646886795421:alarm:prod-monitoring-sqs-crawlinghub-eventbridge-trigger-message-age-high because no identity-based policy allows the cloudwatch:ListTagsForResource action
│ 
│   with module.eventbridge_trigger_queue.aws_cloudwatch_metric_alarm.message-age[0],
│   on .terraform/modules/eventbridge_trigger_queue/terraform/modules/sqs/main.tf line 107, in resource "aws_cloudwatch_metric_alarm" "message-age":
│  107: resource "aws_cloudwatch_metric_alarm" "message-age" {
│ 
╵
╷
│ Error: listing tags for CloudWatch Metric Alarm (arn:aws:cloudwatch:ap-northeast-2:646886795421:alarm:prod-monitoring-sqs-crawlinghub-eventbridge-trigger-messages-visible-high): operation error CloudWatch: ListTagsForResource, https response error StatusCode: 403, RequestID: b01a8dae-6b9c-4a53-b4c8-ac79208886be, api error AccessDenied: User: arn:aws:sts::646886795421:assumed-role/atlantis-ecs-task-prod/731f9812c68d49d69f47d7c93207fa8d is not authorized to perform: cloudwatch:ListTagsForResource on resource: arn:aws:cloudwatch:ap-northeast-2:646886795421:alarm:prod-monitoring-sqs-crawlinghub-eventbridge-trigger-messages-visible-high because no identity-based policy allows the cloudwatch:ListTagsForResource action
│ 
│   with module.eventbridge_trigger_queue.aws_cloudwatch_metric_alarm.messages-visible[0],
│   on .terraform/modules/eventbridge_trigger_queue/terraform/modules/sqs/main.tf line 138, in resource "aws_cloudwatch_metric_alarm" "messages-visible":
│  138: resource "aws_cloudwatch_metric_alarm" "messages-visible" {
│ 
╵
╷
│ Error: listing tags for CloudWatch Metric Alarm (arn:aws:cloudwatch:ap-northeast-2:646886795421:alarm:prod-monitoring-sqs-crawlinghub-eventbridge-trigger-dlq-messages-visible): operation error CloudWatch: ListTagsForResource, https response error StatusCode: 403, RequestID: 6bfa848a-a32f-4f40-ac8b-9c231e1b964e, api error AccessDenied: User: arn:aws:sts::646886795421:assumed-role/atlantis-ecs-task-prod/731f9812c68d49d69f47d7c93207fa8d is not authorized to perform: cloudwatch:ListTagsForResource on resource: arn:aws:cloudwatch:ap-northeast-2:646886795421:alarm:prod-monitoring-sqs-crawlinghub-eventbridge-trigger-dlq-messages-visible because no identity-based policy allows the cloudwatch:ListTagsForResource action
│ 
│   with module.eventbridge_trigger_queue.aws_cloudwatch_metric_alarm.dlq-messages[0],
│   on .terraform/modules/eventbridge_trigger_queue/terraform/modules/sqs/main.tf line 169, in resource "aws_cloudwatch_metric_alarm" "dlq-messages":
│  169: resource "aws_cloudwatch_metric_alarm" "dlq-messages" {
│ 
╵

```
</details>